Обработки/Reports/_ОСВбез7раздела.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОСВбез7раздела</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьНаименованиеСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОСВбез7раздела/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"ОСВ без учета закрытия 7-го раздела",
		"0.16",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	СформироватьОтчет(ДокументРезультат, НастройкиОтчета.Подписант.КонтактноеЛицо, СоздатьГруппировкиОтчета(НастройкиОтчета.ГруппировкиОтчета));
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Функция СоздатьГруппировкиОтчета(СтрокаГруппировки= "") Экспорт 
	
	СписокГруппировок = Новый СписокЗначений;
	Если ПустаяСтрока(СтрокаГруппировки) Тогда 
		СписокГруппировок.Добавить("ПоСубконто", "По субконто", Ложь);
		СписокГруппировок.Добавить("ПоПартиям", "По партиям", Ложь);
		СписокГруппировок.Добавить("ПоДополнительнойАналитике", "По дополнительной аналитике", Ложь);
		СписокГруппировок.Добавить("ПоЛицевымСчетам", "По лицевым счетам", Ложь);	
	Иначе	
		МассивГруппировок = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрЗаменить(СтрокаГруппировки, " ", ""), ",");
		
		Для Каждого Элемент Из МассивГруппировок Цикл
			Если Элемент = "ПоСубконто" Тогда 
				СписокГруппировок.Добавить("ПоСубконто", "По субконто", Истина);
			КонецЕсли;	
			Если Элемент = "ПоПартиям" Тогда 
				СписокГруппировок.Добавить("ПоПартиям", "По партиям", Истина);
			КонецЕсли;	
			Если Элемент = "ПоДополнительнойАналитике" Тогда 
				СписокГруппировок.Добавить("ПоДополнительнойАналитике", "По дополнительной аналитике", Истина);
			КонецЕсли;	
			Если Элемент = "ПоЛицевымСчетам" Тогда 
				СписокГруппировок.Добавить("ПоЛицевымСчетам", "По лицевым счетам", Истина);
			КонецЕсли;			
		КонецЦикла;	
		
		Если СписокГруппировок.Количество() = 0 Тогда 
			ВызватьИсключение "Не заполнен список группировок отчета 'ОСВ без учета 7-го раздела'";
		КонецЕсли;	
		
	КонецЕсли;
			
	Возврат СписокГруппировок;
	
КонецФункции	

#Область ДанныеБухУчета

Процедура ПолучитьЗакрытие7гоРаздела(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СчетДт КАК СчетДт,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1 КАК СубконтоДт1,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт2 КАК СубконтоДт2,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт КАК ЛицевойСчетДт,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДополнительнаяАналитика КАК ДополнительнаяАналитикаДт,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.Партия КАК ПартияДт,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.СтрокаПартии КАК СтрокаПартииДт,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СчетКт КАК СчетКт,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1 КАК СубконтоКт1,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт2 КАК СубконтоКт2,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт КАК ЛицевойСчетКт,
	|	СУММА(ВЫБОР
	|			КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.СчетДт = &Счет47903
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.Период < &НачалоПериодаДата
	|						ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ) КАК СуммаОборотДтНач,
	|	СУММА(ВЫБОР
	|			КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.СчетДт = &Счет47903
	|				ТОГДА ВЫБОР
	|						КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.Период < &НачалоПериодаДата
	|							ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаОборотКтНач,
	|	СУММА(ВЫБОР
	|			КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.СчетДт = &Счет47903
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.Период >= &НачалоПериодаДата
	|						ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ) КАК СуммаОборотДт,
	|	СУММА(ВЫБОР
	|			КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.СчетДт = &Счет47903
	|				ТОГДА ВЫБОР
	|						КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.Период >= &НачалоПериодаДата
	|							ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаОборотКт,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДополнительнаяАналитика КАК ДополнительнаяАналитикаКт,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Партия КАК ПартияКт,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.СтрокаПартии КАК СтрокаПартииКт
	|ПОМЕСТИТЬ _ЗакрытиеРаздела7
	|ИЗ
	|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
	|			&НачалоГода,
	|			&ОкончаниеПериода,
	|			Регистратор,
	|			,
	|			,
	|			,
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления В (&СчетДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт
	|ГДЕ
	|	(ЕдиныйБухгалтерскийУчетОборотыДтКт.СчетДт = &Счет47903
	|				И ЕдиныйБухгалтерскийУчетОборотыДтКт.СчетКт В ИЕРАРХИИ (&СчетаДоходыРасходы)
	|			ИЛИ ЕдиныйБухгалтерскийУчетОборотыДтКт.СчетКт = &Счет47903
	|				И ЕдиныйБухгалтерскийУчетОборотыДтКт.СчетДт В ИЕРАРХИИ (&СчетаДоходыРасходы)
	|				И ВЫБОР
	|					КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.СчетДт = &Счет47903
	|						ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДополнительнаяАналитика
	|					ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДополнительнаяАналитика
	|				КОНЕЦ = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ПустаяСсылка))
	|	И ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор) = ТИП(Документ.ЗакрытиеБухгалтерскихСчетов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СчетДт,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт2,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СчетКт,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт2,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДополнительнаяАналитика,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.Партия,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.СтрокаПартии,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДополнительнаяАналитика,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Партия,
	|	ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.СтрокаПартии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.СчетКт
	|		ИНАЧЕ _ЗакрытиеРаздела7.СчетДт
	|	КОНЕЦ КАК Счет,
	|	СУММА(_ЗакрытиеРаздела7.СуммаОборотДтНач) КАК СуммаОборотДтНач,
	|	СУММА(_ЗакрытиеРаздела7.СуммаОборотКтНач) КАК СуммаОборотКтНач,
	|	СУММА(_ЗакрытиеРаздела7.СуммаОборотДт) КАК СуммаОборотДт,
	|	СУММА(_ЗакрытиеРаздела7.СуммаОборотКт) КАК СуммаОборотКт
	|ПОМЕСТИТЬ _ЗакрытиеПоСчетам
	|ИЗ
	|	_ЗакрытиеРаздела7 КАК _ЗакрытиеРаздела7
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.СчетКт
	|		ИНАЧЕ _ЗакрытиеРаздела7.СчетДт
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.СчетДт
	|		ИНАЧЕ _ЗакрытиеРаздела7.СчетКт
	|	КОНЕЦ,
	|	СУММА(_ЗакрытиеРаздела7.СуммаОборотКтНач),
	|	СУММА(_ЗакрытиеРаздела7.СуммаОборотДтНач),
	|	СУММА(_ЗакрытиеРаздела7.СуммаОборотКт),
	|	СУММА(_ЗакрытиеРаздела7.СуммаОборотДт)
	|ИЗ
	|	_ЗакрытиеРаздела7 КАК _ЗакрытиеРаздела7
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.СчетДт
	|		ИНАЧЕ _ЗакрытиеРаздела7.СчетКт
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.СчетКт
	|		ИНАЧЕ _ЗакрытиеРаздела7.СчетДт
	|	КОНЕЦ КАК Счет,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.СубконтоКт1
	|		ИНАЧЕ _ЗакрытиеРаздела7.СубконтоДт1
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.СубконтоКт2
	|		ИНАЧЕ _ЗакрытиеРаздела7.СубконтоДт2
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.ЛицевойСчетКт
	|		ИНАЧЕ _ЗакрытиеРаздела7.ЛицевойСчетДт
	|	КОНЕЦ КАК ЛицевойСчет,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.ДополнительнаяАналитикаКт
	|		ИНАЧЕ _ЗакрытиеРаздела7.ДополнительнаяАналитикаДт
	|	КОНЕЦ КАК ДополнительнаяАналитика,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.ПартияКт
	|		ИНАЧЕ _ЗакрытиеРаздела7.ПартияДт
	|	КОНЕЦ КАК Партия,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.СтрокаПартииКт
	|		ИНАЧЕ _ЗакрытиеРаздела7.СтрокаПартииДт
	|	КОНЕЦ КАК СтрокаПартии,
	|	СУММА(_ЗакрытиеРаздела7.СуммаОборотДтНач) КАК СуммаОборотДтНач,
	|	СУММА(_ЗакрытиеРаздела7.СуммаОборотКтНач) КАК СуммаОборотКтНач,
	|	СУММА(_ЗакрытиеРаздела7.СуммаОборотДт) КАК СуммаОборотДт,
	|	СУММА(_ЗакрытиеРаздела7.СуммаОборотКт) КАК СуммаОборотКт
	|ПОМЕСТИТЬ _ЗакрытиеПоСчетамИСубконто
	|ИЗ
	|	_ЗакрытиеРаздела7 КАК _ЗакрытиеРаздела7
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.СчетКт
	|		ИНАЧЕ _ЗакрытиеРаздела7.СчетДт
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.СубконтоКт1
	|		ИНАЧЕ _ЗакрытиеРаздела7.СубконтоДт1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.СубконтоКт2
	|		ИНАЧЕ _ЗакрытиеРаздела7.СубконтоДт2
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.ЛицевойСчетКт
	|		ИНАЧЕ _ЗакрытиеРаздела7.ЛицевойСчетДт
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.ДополнительнаяАналитикаКт
	|		ИНАЧЕ _ЗакрытиеРаздела7.ДополнительнаяАналитикаДт
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.ПартияКт
	|		ИНАЧЕ _ЗакрытиеРаздела7.ПартияДт
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.СтрокаПартииКт
	|		ИНАЧЕ _ЗакрытиеРаздела7.СтрокаПартииДт
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.СчетДт
	|		ИНАЧЕ _ЗакрытиеРаздела7.СчетКт
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.СубконтоДт1
	|		ИНАЧЕ _ЗакрытиеРаздела7.СубконтоКт1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.СубконтоДт2
	|		ИНАЧЕ _ЗакрытиеРаздела7.СубконтоКт2
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.ЛицевойСчетДт
	|		ИНАЧЕ _ЗакрытиеРаздела7.ЛицевойСчетКт
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.ДополнительнаяАналитикаДт
	|		ИНАЧЕ _ЗакрытиеРаздела7.ДополнительнаяАналитикаКт
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.ПартияДт
	|		ИНАЧЕ _ЗакрытиеРаздела7.ПартияКт
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.СтрокаПартииДт
	|		ИНАЧЕ _ЗакрытиеРаздела7.СтрокаПартииКт
	|	КОНЕЦ,
	|	СУММА(_ЗакрытиеРаздела7.СуммаОборотКтНач),
	|	СУММА(_ЗакрытиеРаздела7.СуммаОборотДтНач),
	|	СУММА(_ЗакрытиеРаздела7.СуммаОборотКт),
	|	СУММА(_ЗакрытиеРаздела7.СуммаОборотДт)
	|ИЗ
	|	_ЗакрытиеРаздела7 КАК _ЗакрытиеРаздела7
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.СчетДт
	|		ИНАЧЕ _ЗакрытиеРаздела7.СчетКт
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.СубконтоДт1
	|		ИНАЧЕ _ЗакрытиеРаздела7.СубконтоКт1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.СубконтоДт2
	|		ИНАЧЕ _ЗакрытиеРаздела7.СубконтоКт2
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.ЛицевойСчетДт
	|		ИНАЧЕ _ЗакрытиеРаздела7.ЛицевойСчетКт
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.ДополнительнаяАналитикаДт
	|		ИНАЧЕ _ЗакрытиеРаздела7.ДополнительнаяАналитикаКт
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.ПартияДт
	|		ИНАЧЕ _ЗакрытиеРаздела7.ПартияКт
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА _ЗакрытиеРаздела7.СчетДт = &Счет47903
	|			ТОГДА _ЗакрытиеРаздела7.СтрокаПартииДт
	|		ИНАЧЕ _ЗакрытиеРаздела7.СтрокаПартииКт
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет КАК Счет,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Субконто1,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2 КАК Субконто2,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет.Партия КАК Партия,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет.СтрокаПартии КАК СтрокаПартии,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокДт КАК СуммаНачальныйОстатокДт,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокКт КАК СуммаНачальныйОстатокКт,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт - ЕСТЬNULL(_ЗакрытиеПоСчетамИСубконто.СуммаОборотДт, 0) КАК СуммаОборотДт,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт - ЕСТЬNULL(_ЗакрытиеПоСчетамИСубконто.СуммаОборотКт, 0) КАК СуммаОборотКт,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокДт + ЕСТЬNULL(_ЗакрытиеПоСчетамИСубконто.СуммаОборотКт, 0) КАК СуммаКонечныйОстатокДт,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокКт + ЕСТЬNULL(_ЗакрытиеПоСчетамИСубконто.СуммаОборотДт, 0) КАК СуммаКонечныйОстатокКт
	|ПОМЕСТИТЬ _ОСВ
	|ИЗ
	|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&ОкончаниеПериода,
	|			Период,
	|			ДвиженияИГраницыПериода,
	|			,
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗакрытиеПоСчетамИСубконто КАК _ЗакрытиеПоСчетамИСубконто
	|		ПО ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет = _ЗакрытиеПоСчетамИСубконто.Счет
	|			И (ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1, """") = ЕСТЬNULL(_ЗакрытиеПоСчетамИСубконто.Субконто1, """"))
	|			И (ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2, """") = ЕСТЬNULL(_ЗакрытиеПоСчетамИСубконто.Субконто2, """"))
	|			И (ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет, """") = ЕСТЬNULL(_ЗакрытиеПоСчетамИСубконто.ЛицевойСчет, """"))
	|			И (ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет.ДополнительнаяАналитика, """") = ЕСТЬNULL(_ЗакрытиеПоСчетамИСубконто.ДополнительнаяАналитика, """"))
	|			И (ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет.Партия, """") = ЕСТЬNULL(_ЗакрытиеПоСчетамИСубконто.Партия, """"))
	|			И (ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет.СтрокаПартии, """") = ЕСТЬNULL(_ЗакрытиеПоСчетамИСубконто.СтрокаПартии, """"))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет КАК Счет,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Субконто1,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2 КАК Субконто2,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет.Партия КАК Партия,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет.СтрокаПартии КАК СтрокаПартии,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокДт КАК СуммаНачальныйОстатокДт,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокКт КАК СуммаНачальныйОстатокКт,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт - ЕСТЬNULL(_ЗакрытиеПоСчетамИСубконто.СуммаОборотДтНач, 0) КАК СуммаОборотДт,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт - ЕСТЬNULL(_ЗакрытиеПоСчетамИСубконто.СуммаОборотКтНач, 0) КАК СуммаОборотКт,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокДт + ЕСТЬNULL(_ЗакрытиеПоСчетамИСубконто.СуммаОборотКтНач, 0) КАК СуммаКонечныйОстатокДт,
	|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокКт + ЕСТЬNULL(_ЗакрытиеПоСчетамИСубконто.СуммаОборотДтНач, 0) КАК СуммаКонечныйОстатокКт
	|ПОМЕСТИТЬ _ОСВНач
	|ИЗ
	|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
	|			&НачалоГода,
	|			&НачалоПериода,
	|			Период,
	|			ДвиженияИГраницыПериода,
	|			,
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗакрытиеПоСчетамИСубконто КАК _ЗакрытиеПоСчетамИСубконто
	|		ПО ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет = _ЗакрытиеПоСчетамИСубконто.Счет
	|			И (ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1, """") = ЕСТЬNULL(_ЗакрытиеПоСчетамИСубконто.Субконто1, """"))
	|			И (ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2, """") = ЕСТЬNULL(_ЗакрытиеПоСчетамИСубконто.Субконто2, """"))
	|			И (ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет, """") = ЕСТЬNULL(_ЗакрытиеПоСчетамИСубконто.ЛицевойСчет, """"))
	|			И (ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет.ДополнительнаяАналитика, """") = ЕСТЬNULL(_ЗакрытиеПоСчетамИСубконто.ДополнительнаяАналитика, """"))
	|			И (ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет.Партия, """") = ЕСТЬNULL(_ЗакрытиеПоСчетамИСубконто.Партия, """"))
	|			И (ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет.СтрокаПартии, """") = ЕСТЬNULL(_ЗакрытиеПоСчетамИСубконто.СтрокаПартии, """"))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(_ОСВ.Счет, _ОСВНач.Счет) КАК Счет,
	|	ЕСТЬNULL(_ОСВ.Субконто1, _ОСВНач.Субконто1) КАК Субконто1,
	|	ЕСТЬNULL(_ОСВ.Субконто2, _ОСВНач.Субконто2) КАК Субконто2,
	|	ЕСТЬNULL(_ОСВ.ЛицевойСчет, _ОСВНач.ЛицевойСчет) КАК ЛицевойСчет,
	|	ЕСТЬNULL(_ОСВ.ДополнительнаяАналитика, _ОСВНач.ДополнительнаяАналитика) КАК ДополнительнаяАналитика,
	|	ЕСТЬNULL(_ОСВ.Партия, _ОСВНач.Партия) КАК Партия,
	|	ЕСТЬNULL(_ОСВ.СтрокаПартии, _ОСВНач.СтрокаПартии) КАК СтрокаПартии,
	|	ЕСТЬNULL(_ОСВНач.СуммаКонечныйОстатокДт, _ОСВ.СуммаНачальныйОстатокДт) КАК СНД,
	|	ЕСТЬNULL(_ОСВНач.СуммаКонечныйОстатокКт, _ОСВ.СуммаНачальныйОстатокКт) КАК СНК,
	|	ЕСТЬNULL(_ОСВ.СуммаОборотДт, 0) КАК ДО,
	|	ЕСТЬNULL(_ОСВ.СуммаОборотКт, 0) КАК КО,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(_ОСВ.Счет, _ОСВНач.Счет) В ИЕРАРХИИ (&СчетаДоходыРасходы)
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(_ОСВНач.СуммаКонечныйОстатокДт, _ОСВ.СуммаНачальныйОстатокДт) - ЕСТЬNULL(_ОСВНач.СуммаКонечныйОстатокКт, _ОСВ.СуммаНачальныйОстатокКт) + ЕСТЬNULL(_ОСВ.СуммаОборотДт, 0) - ЕСТЬNULL(_ОСВ.СуммаОборотКт, 0) > 0
	|						ТОГДА ЕСТЬNULL(_ОСВНач.СуммаКонечныйОстатокДт, _ОСВ.СуммаНачальныйОстатокДт) - ЕСТЬNULL(_ОСВНач.СуммаКонечныйОстатокКт, _ОСВ.СуммаНачальныйОстатокКт) + ЕСТЬNULL(_ОСВ.СуммаОборотДт, 0) - ЕСТЬNULL(_ОСВ.СуммаОборотКт, 0)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL(_ОСВ.СуммаКонечныйОстатокДт, _ОСВНач.СуммаКонечныйОстатокДт)
	|	КОНЕЦ КАК СКД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(_ОСВ.Счет, _ОСВНач.Счет) В (&СчетаДоходыРасходы)
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(_ОСВНач.СуммаКонечныйОстатокДт, _ОСВ.СуммаНачальныйОстатокДт) - ЕСТЬNULL(_ОСВНач.СуммаКонечныйОстатокКт, _ОСВ.СуммаНачальныйОстатокКт) + ЕСТЬNULL(_ОСВ.СуммаОборотДт, 0) - ЕСТЬNULL(_ОСВ.СуммаОборотКт, 0) < 0
	|						ТОГДА -ЕСТЬNULL(_ОСВНач.СуммаКонечныйОстатокДт, _ОСВ.СуммаНачальныйОстатокДт) + ЕСТЬNULL(_ОСВНач.СуммаКонечныйОстатокКт, _ОСВ.СуммаНачальныйОстатокКт) - ЕСТЬNULL(_ОСВ.СуммаОборотДт, 0) + ЕСТЬNULL(_ОСВ.СуммаОборотКт, 0)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL(_ОСВ.СуммаКонечныйОстатокКт, _ОСВНач.СуммаКонечныйОстатокКт)
	|	КОНЕЦ КАК СКК
	|ПОМЕСТИТЬ _ОСВбез7раздела
	|ИЗ
	|	_ОСВ КАК _ОСВ
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ОСВНач КАК _ОСВНач
	|		ПО _ОСВ.Счет = _ОСВНач.Счет
	|			И _ОСВ.Субконто1 = _ОСВНач.Субконто1
	|			И _ОСВ.Субконто2 = _ОСВНач.Субконто2
	|			И _ОСВ.ЛицевойСчет = _ОСВНач.ЛицевойСчет
	|			И _ОСВ.ДополнительнаяАналитика = _ОСВНач.ДополнительнаяАналитика
	|			И _ОСВ.Партия = _ОСВНач.Партия
	|			И _ОСВ.СтрокаПартии = _ОСВНач.СтрокаПартии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	_ОСВбез7раздела.Субконто1 КАК ЦеннаяБумага
	|ПОМЕСТИТЬ _ЦенныеБумаги
	|ИЗ
	|	_ОСВбез7раздела КАК _ОСВбез7раздела
	|ГДЕ
	|	(_ОСВбез7раздела.Субконто1 ССЫЛКА Справочник.Акции
	|			ИЛИ _ОСВбез7раздела.Субконто1 ССЫЛКА Справочник.Векселя
	|			ИЛИ _ОСВбез7раздела.Субконто1 ССЫЛКА Справочник.ДепозитарныеРасписки
	|			ИЛИ _ОСВбез7раздела.Субконто1 ССЫЛКА Справочник.Доли
	|			ИЛИ _ОСВбез7раздела.Субконто1 ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
	|			ИЛИ _ОСВбез7раздела.Субконто1 ССЫЛКА Справочник.Облигации
	|			ИЛИ _ОСВбез7раздела.Субконто1 ССЫЛКА Справочник.Паи
	|			ИЛИ _ОСВбез7раздела.Субконто1 ССЫЛКА Справочник.ПроизводныеФинансовыеИнструменты)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	_ОСВбез7раздела.Субконто2
	|ИЗ
	|	_ОСВбез7раздела КАК _ОСВбез7раздела
	|ГДЕ
	|	(_ОСВбез7раздела.Субконто2 ССЫЛКА Справочник.Акции
	|			ИЛИ _ОСВбез7раздела.Субконто2 ССЫЛКА Справочник.Векселя
	|			ИЛИ _ОСВбез7раздела.Субконто2 ССЫЛКА Справочник.ДепозитарныеРасписки
	|			ИЛИ _ОСВбез7раздела.Субконто2 ССЫЛКА Справочник.Доли
	|			ИЛИ _ОСВбез7раздела.Субконто2 ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
	|			ИЛИ _ОСВбез7раздела.Субконто2 ССЫЛКА Справочник.Облигации
	|			ИЛИ _ОСВбез7раздела.Субконто2 ССЫЛКА Справочник.Паи
	|			ИЛИ _ОСВбез7раздела.Субконто2 ССЫЛКА Справочник.ПроизводныеФинансовыеИнструменты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Акции)
	|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).Эмитент.Наименование) + "", "" + ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер <> """"
	|						ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
	|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
	|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).ВалютаНоминала.Наименование
	|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Векселя)
	|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.Наименование) + "", "" + ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).Номер <> """"
	|						ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).Номер
	|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
	|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).ВалютаНоминала.Наименование
	|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
	|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.Наименование) + "", "" + ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).РегистрационныйНомер <> """"
	|						ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).РегистрационныйНомер
	|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
	|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).ВалютаНоминала.Наименование
	|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Доли)
	|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо.Наименование) + "", "" + ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Доли).ВалютаНоминала.Наименование
	|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
	|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.Наименование) + "", "" + ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер <> """"
	|						ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер
	|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
	|				КОНЕЦ + ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ВалютаНоминала.Наименование
	|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
	|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.Наименование) + "", "" + ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер <> """"
	|						ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
	|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
	|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала.Наименование
	|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Паи)
	|			ТОГДА """" + РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда + "", "" + ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер <> """"
	|						ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
	|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
	|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Паи).ВалютаНоминала.Наименование
	|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ПроизводныеФинансовыеИнструменты)
	|			ТОГДА """" + ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
	|		ИНАЧЕ _ЦенныеБумаги.ЦеннаяБумага.Наименование
	|	КОНЕЦ КАК ЦенныеБумагиНаименование
	|ПОМЕСТИТЬ _ЦенныеБумагиНаименование
	|ИЗ
	|	_ЦенныеБумаги КАК _ЦенныеБумаги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
	|				&ОкончаниеПериода,
	|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
	|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
	|		ПО (ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Акции)
	|					ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).Эмитент.ЮрФизЛицо
	|				КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Векселя)
	|					ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
	|				КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
	|					ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.ЮрФизЛицо
	|				КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Доли)
	|					ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо
	|				КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
	|					ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
	|				КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
	|					ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
	|			КОНЕЦ = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ОкончаниеПериода, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВторговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследнихISIN
	|		ПО _ЦенныеБумаги.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследнихISIN.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ОкончаниеПериода, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБ)) КАК КодыВТорговыхСистемахСрезПоследнихКодНаММВБ
	|		ПО _ЦенныеБумаги.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&ОкончаниеПериода, ) КАК РеквизитыПИФСрезПоследних
	|		ПО (ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Паи)
	|					ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	_ОСВбез7раздела.Счет КАК Счет,
	|	ЕСТЬNULL(_ЦенныеБумагиСубконто1.ЦенныеБумагиНаименование, ПРЕДСТАВЛЕНИЕ(_ОСВбез7раздела.Субконто1)) КАК Субконто1,
	|	ЕСТЬNULL(_ЦенныеБумагиСубконто2.ЦенныеБумагиНаименование, ПРЕДСТАВЛЕНИЕ(_ОСВбез7раздела.Субконто2)) КАК Субконто2,
	|	_ОСВбез7раздела.ЛицевойСчет КАК ЛицевойСчет,
	|	_ОСВбез7раздела.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
	|	_ОСВбез7раздела.Партия КАК Партия,
	|	_ОСВбез7раздела.СтрокаПартии КАК СтрокаПартии,
	|	_ОСВбез7раздела.СНД КАК СНД,
	|	_ОСВбез7раздела.СНК КАК СНК,
	|	_ОСВбез7раздела.ДО КАК ДО,
	|	_ОСВбез7раздела.КО КАК КО,
	|	_ОСВбез7раздела.СКД КАК СКД,
	|	_ОСВбез7раздела.СКК КАК СКК
	|ПОМЕСТИТЬ _ОСВдляОтчета
	|ИЗ
	|	_ОСВбез7раздела КАК _ОСВбез7раздела
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумагиНаименование КАК _ЦенныеБумагиСубконто1
	|		ПО _ОСВбез7раздела.Субконто1 = _ЦенныеБумагиСубконто1.ЦеннаяБумага
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумагиНаименование КАК _ЦенныеБумагиСубконто2
	|		ПО _ОСВбез7раздела.Субконто2 = _ЦенныеБумагиСубконто2.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ _ЗакрытиеРаздела7
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ _ЗакрытиеПоСчетамИСубконто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ _ОСВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ _ОСВНач
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ _ЦенныеБумаги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ _ЦенныеБумагиНаименование";
	
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("НачалоГода", Новый Граница(НачалоГода(ЭтотОбъект.Период.ДатаНачала), ВидГраницы.Включая)); //дата реформации ?
	Запрос.УстановитьПараметр("НачалоПериода", Новый Граница(ЭтотОбъект.Период.ДатаНачала, ВидГраницы.Включая)); //дата реформации ?
	Запрос.УстановитьПараметр("НачалоПериодаДата", ЭтотОбъект.Период.ДатаНачала);	
	Запрос.УстановитьПараметр("ОкончаниеПериода", Новый Граница(ЭтотОбъект.Период.ДатаОкончания, ВидГраницы.Включая));
	
	Запрос.УстановитьПараметр("Счет47903", ПланыСчетов.Единый.АктивыВДУ03);
	
	СчетаДоходыРасходы = Новый Массив;
	СчетаДоходыРасходы.Добавить(ПланыСчетов.Единый.ПрибыльУбытокПрошлогоГода);
	СчетаДоходыРасходы.Добавить(ПланыСчетов.Единый.ПроцентныеДоходы);
	СчетаДоходыРасходы.Добавить(ПланыСчетов.Единый.ПроцентныеРасходы);
	СчетаДоходыРасходы.Добавить(ПланыСчетов.Единый.ДоходыРасходыПоРезервам);
	СчетаДоходыРасходы.Добавить(ПланыСчетов.Единый.ДоходыРасходыОтОпераций);
	СчетаДоходыРасходы.Добавить(ПланыСчетов.Единый.ПрочиеДоходыРасходы);
	СчетаДоходыРасходы.Добавить(ПланыСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности);
	СчетаДоходыРасходы.Добавить(ПланыСчетов.Единый.ПроцентныеДоходыПрошлогоГода);
	СчетаДоходыРасходы.Добавить(ПланыСчетов.Единый.ДоходыИРасходыКромеПроцентныхОтОперацийСФинансовымиИнструментамиПрошлогоГода);
	СчетаДоходыРасходы.Добавить(ПланыСчетов.Единый.ДоходыИРасходыПоДеятельностиПоНПО);
	
	Запрос.УстановитьПараметр("СчетаДоходыРасходы", СчетаДоходыРасходы);	

	Запрос.Выполнить();
		
КонецПроцедуры

Функция ПолучитьТаблицуСчетов(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Родитель = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПустаяСсылка)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Родитель
		|	КОНЕЦ КАК СчетРодитель,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет КАК Счет,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Родитель.Код, ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Код) КАК СчетРодительКод,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Код КАК СчетКод,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокДт КАК СуммаНачальныйОстатокДт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокКт КАК СуммаНачальныйОстатокКт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт - ЕСТЬNULL(_ЗакрытиеПоСчетам.СуммаОборотДт, 0) КАК СуммаОборотДт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт - ЕСТЬNULL(_ЗакрытиеПоСчетам.СуммаОборотКт, 0) КАК СуммаОборотКт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокДт + ЕСТЬNULL(_ЗакрытиеПоСчетам.СуммаОборотКт, 0) КАК СуммаКонечныйОстатокДт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокКт + ЕСТЬNULL(_ЗакрытиеПоСчетам.СуммаОборотДт, 0) КАК СуммаКонечныйОстатокКт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Наименование КАК СчетНаименование,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Родитель.Наименование, ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Наименование) КАК СчетРодительНаименование
		|ПОМЕСТИТЬ ОстаткиСчета
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&ОкончаниеПериода,
		|			Период,
		|			ДвиженияИГраницыПериода,
		|			,
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗакрытиеПоСчетам КАК _ЗакрытиеПоСчетам
		|		ПО ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет = _ЗакрытиеПоСчетам.Счет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Родитель = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПустаяСсылка)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Родитель
		|	КОНЕЦ КАК СчетРодитель,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет КАК Счет,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Родитель.Код, ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Код) КАК СчетРодительКод,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Код КАК СчетКод,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокДт КАК СуммаНачальныйОстатокДт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокКт КАК СуммаНачальныйОстатокКт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт - ЕСТЬNULL(_ЗакрытиеПоСчетам.СуммаОборотДтНач, 0) КАК СуммаОборотДт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт - ЕСТЬNULL(_ЗакрытиеПоСчетам.СуммаОборотКтНач, 0) КАК СуммаОборотКт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокДт + ЕСТЬNULL(_ЗакрытиеПоСчетам.СуммаОборотКтНач, 0) КАК СуммаКонечныйОстатокДт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокКт + ЕСТЬNULL(_ЗакрытиеПоСчетам.СуммаОборотДтНач, 0) КАК СуммаКонечныйОстатокКт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Наименование КАК СчетНаименование,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Родитель.Наименование, ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Наименование) КАК СчетРодительНаименование
		|ПОМЕСТИТЬ ОстаткиСчетаНач
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоГода,
		|			&НачалоПериода,
		|			Период,
		|			ДвиженияИГраницыПериода,
		|			,
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗакрытиеПоСчетам КАК _ЗакрытиеПоСчетам
		|		ПО ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет = _ЗакрытиеПоСчетам.Счет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ОстаткиСчета.СчетРодитель, ОстаткиСчетаНач.СчетРодитель) КАК СчетРодитель,
		|	ЕСТЬNULL(ОстаткиСчета.Счет, ОстаткиСчетаНач.Счет) КАК Счет,
		|	ЕСТЬNULL(ОстаткиСчета.СчетРодительКод, ОстаткиСчетаНач.СчетРодительКод) КАК СчетРодительКод,
		|	ЕСТЬNULL(ОстаткиСчета.СчетКод, ОстаткиСчетаНач.СчетКод) КАК СчетКод,
		|	ЕСТЬNULL(ОстаткиСчетаНач.СуммаКонечныйОстатокДт, ОстаткиСчета.СуммаНачальныйОстатокДт) КАК СуммаНачальныйОстатокДт,
		|	ЕСТЬNULL(ОстаткиСчетаНач.СуммаКонечныйОстатокКт, ОстаткиСчета.СуммаНачальныйОстатокКт) КАК СуммаНачальныйОстатокКт,
		|	ЕСТЬNULL(ОстаткиСчета.СуммаОборотДт, 0) КАК СуммаОборотДт,
		|	ЕСТЬNULL(ОстаткиСчета.СуммаОборотКт, 0) КАК СуммаОборотКт,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ОстаткиСчета.СчетРодитель, ОстаткиСчетаНач.СчетРодитель) В (&СчетаДоходыРасходы)
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(ОстаткиСчетаНач.СуммаКонечныйОстатокДт, ОстаткиСчета.СуммаНачальныйОстатокДт) - ЕСТЬNULL(ОстаткиСчетаНач.СуммаКонечныйОстатокКт, ОстаткиСчета.СуммаНачальныйОстатокКт) + ЕСТЬNULL(ОстаткиСчета.СуммаОборотДт, 0) - ЕСТЬNULL(ОстаткиСчета.СуммаОборотКт, 0) > 0
		|						ТОГДА ЕСТЬNULL(ОстаткиСчетаНач.СуммаКонечныйОстатокДт, ОстаткиСчета.СуммаНачальныйОстатокДт) - ЕСТЬNULL(ОстаткиСчетаНач.СуммаКонечныйОстатокКт, ОстаткиСчета.СуммаНачальныйОстатокКт) + ЕСТЬNULL(ОстаткиСчета.СуммаОборотДт, 0) - ЕСТЬNULL(ОстаткиСчета.СуммаОборотКт, 0)
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		ИНАЧЕ ЕСТЬNULL(ОстаткиСчета.СуммаКонечныйОстатокДт, ОстаткиСчетаНач.СуммаКонечныйОстатокДт)
		|	КОНЕЦ КАК СуммаКонечныйОстатокДт,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ОстаткиСчета.СчетРодитель, ОстаткиСчетаНач.СчетРодитель) В (&СчетаДоходыРасходы)
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(ОстаткиСчетаНач.СуммаКонечныйОстатокДт, ОстаткиСчета.СуммаНачальныйОстатокДт) - ЕСТЬNULL(ОстаткиСчетаНач.СуммаКонечныйОстатокКт, ОстаткиСчета.СуммаНачальныйОстатокКт) + ЕСТЬNULL(ОстаткиСчета.СуммаОборотДт, 0) - ЕСТЬNULL(ОстаткиСчета.СуммаОборотКт, 0) < 0
		|						ТОГДА -ЕСТЬNULL(ОстаткиСчетаНач.СуммаКонечныйОстатокДт, ОстаткиСчета.СуммаНачальныйОстатокДт) + ЕСТЬNULL(ОстаткиСчетаНач.СуммаКонечныйОстатокКт, ОстаткиСчета.СуммаНачальныйОстатокКт) - ЕСТЬNULL(ОстаткиСчета.СуммаОборотДт, 0) + ЕСТЬNULL(ОстаткиСчета.СуммаОборотКт, 0)
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		ИНАЧЕ ЕСТЬNULL(ОстаткиСчета.СуммаКонечныйОстатокКт, ОстаткиСчетаНач.СуммаКонечныйОстатокКт)
		|	КОНЕЦ КАК СуммаКонечныйОстатокКт,
		|	ЕСТЬNULL(ОстаткиСчета.СчетНаименование, ОстаткиСчетаНач.СчетНаименование) КАК СчетНаименование,
		|	ЕСТЬNULL(ОстаткиСчета.СчетРодительНаименование, ОстаткиСчетаНач.СчетРодительНаименование) КАК СчетРодительНаименование
		|ПОМЕСТИТЬ ОстаткиСчетаБез7Раздела
		|ИЗ
		|	ОстаткиСчета КАК ОстаткиСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиСчетаНач КАК ОстаткиСчетаНач
		|		ПО ОстаткиСчета.Счет = ОстаткиСчетаНач.Счет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИСТИНА КАК Субсчет,
		|	ОстаткиСчетаБез7Раздела.Счет КАК Счет,
		|	ОстаткиСчетаБез7Раздела.СчетКод КАК СчетКод,
		|	ОстаткиСчетаБез7Раздела.СуммаНачальныйОстатокДт КАК СНД,
		|	ОстаткиСчетаБез7Раздела.СуммаНачальныйОстатокКт КАК СНК,
		|	ОстаткиСчетаБез7Раздела.СуммаОборотДт КАК ДО,
		|	ОстаткиСчетаБез7Раздела.СуммаОборотКт КАК КО,
		|	ОстаткиСчетаБез7Раздела.СуммаКонечныйОстатокДт КАК СКД,
		|	ОстаткиСчетаБез7Раздела.СуммаКонечныйОстатокКт КАК СКК,
		|	ОстаткиСчетаБез7Раздела.СчетНаименование КАК СчетНаименование
		|ИЗ
		|	ОстаткиСчетаБез7Раздела КАК ОстаткиСчетаБез7Раздела
		|ГДЕ
		|	ОстаткиСчетаБез7Раздела.СчетКод <> ""000""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ,
		|	ОстаткиСчета.СчетРодитель,
		|	ОстаткиСчета.СчетРодительКод,
		|	СУММА(ОстаткиСчета.СуммаНачальныйОстатокДт),
		|	СУММА(ОстаткиСчета.СуммаНачальныйОстатокКт),
		|	СУММА(ОстаткиСчета.СуммаОборотДт),
		|	СУММА(ОстаткиСчета.СуммаОборотКт),
		|	СУММА(ОстаткиСчета.СуммаКонечныйОстатокДт),
		|	СУММА(ОстаткиСчета.СуммаКонечныйОстатокКт),
		|	ОстаткиСчета.СчетРодительНаименование
		|ИЗ
		|	ОстаткиСчета КАК ОстаткиСчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиСчета.СчетРодитель,
		|	ОстаткиСчета.СчетРодительКод,
		|	ОстаткиСчета.СчетРодительНаименование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ,
		|	""Итого"",
		|	""Итого"",
		|	СУММА(ОстаткиСчета.СуммаНачальныйОстатокДт),
		|	СУММА(ОстаткиСчета.СуммаНачальныйОстатокКт),
		|	СУММА(ОстаткиСчета.СуммаОборотДт),
		|	СУММА(ОстаткиСчета.СуммаОборотКт),
		|	СУММА(ОстаткиСчета.СуммаКонечныйОстатокДт),
		|	СУММА(ОстаткиСчета.СуммаКонечныйОстатокКт),
		|	""Итого""
		|ИЗ
		|	ОстаткиСчета КАК ОстаткиСчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	СчетКод";
	
	Запрос.УстановитьПараметр("НачалоПериода", Новый Граница(НачалоДня(ЭтотОбъект.Период.ДатаНачала), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ОкончаниеПериода", Новый Граница(КонецДня(ЭтотОбъект.Период.ДатаОкончания), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("НачалоГода", Новый Граница(НачалоГода(ЭтотОбъект.Период.ДатаНачала), ВидГраницы.Включая)); 
	
	СчетаДоходыРасходы = Новый Массив;
	СчетаДоходыРасходы.Добавить(ПланыСчетов.Единый.ПрибыльУбытокПрошлогоГода);
	СчетаДоходыРасходы.Добавить(ПланыСчетов.Единый.ПроцентныеДоходы);
	СчетаДоходыРасходы.Добавить(ПланыСчетов.Единый.ПроцентныеРасходы);
	СчетаДоходыРасходы.Добавить(ПланыСчетов.Единый.ДоходыРасходыПоРезервам);
	СчетаДоходыРасходы.Добавить(ПланыСчетов.Единый.ДоходыРасходыОтОпераций);
	СчетаДоходыРасходы.Добавить(ПланыСчетов.Единый.ПрочиеДоходыРасходы);
	СчетаДоходыРасходы.Добавить(ПланыСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности);
	СчетаДоходыРасходы.Добавить(ПланыСчетов.Единый.ПроцентныеДоходыПрошлогоГода);
	СчетаДоходыРасходы.Добавить(ПланыСчетов.Единый.ДоходыИРасходыКромеПроцентныхОтОперацийСФинансовымиИнструментамиПрошлогоГода);
	СчетаДоходыРасходы.Добавить(ПланыСчетов.Единый.ДоходыИРасходыПоДеятельностиПоНПО);

	Запрос.УстановитьПараметр("СчетаДоходыРасходы", СчетаДоходыРасходы);	
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ПолучитьДанныеПоСубконто(МенеджерВременныхТаблиц, СписокГруппировкиЗапроса)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц; 
	Запрос.Текст =  
		"ВЫБРАТЬ
		|	_ОСВдляОтчета.Счет КАК Счет,
		|	_ОСВдляОтчета.Субконто1 КАК Субконто1,
		|	_ОСВдляОтчета.Субконто2 КАК Субконто2,
		|	_ОСВдляОтчета.ЛицевойСчет КАК ЛицевойСчет,
		|	_ОСВдляОтчета.Партия КАК Партия,
		|	_ОСВдляОтчета.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
		|	_ОСВдляОтчета.СНД КАК СНД,
		|	_ОСВдляОтчета.СНК КАК СНК,
		|	_ОСВдляОтчета.ДО КАК ДО,
		|	_ОСВдляОтчета.КО КАК КО,
		|	_ОСВдляОтчета.СКД КАК СКД,
		|	_ОСВдляОтчета.СКК КАК СКК,
		|	ЕСТЬNULL(ДанныеСчета.КоличествоСубконто, 0) КАК КоличествоСубконто,
		|	ВЫБОР
		|		КОГДА _ОСВдляОтчета.Счет В ИЕРАРХИИ (&СчетаПартииИДопаналитики)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьПартииИДопАналитики
		|ИЗ
		|	_ОСВдляОтчета КАК _ОСВдляОтчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЕдиныйВидыСубконто.Ссылка КАК Счет,
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕдиныйВидыСубконто.ВидСубконто) КАК КоличествоСубконто
		|		ИЗ
		|			ПланСчетов.Единый.ВидыСубконто КАК ЕдиныйВидыСубконто
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЕдиныйВидыСубконто.Ссылка) КАК ДанныеСчета
		|		ПО _ОСВдляОтчета.Счет = ДанныеСчета.Счет
		|ИТОГИ
		|	СУММА(СНД),
		|	СУММА(СНК),
		|	СУММА(ДО),
		|	СУММА(КО),
		|	СУММА(СКД),
		|	СУММА(СКК),
		|	МАКСИМУМ(КоличествоСубконто)
		|ПО
		|	Счет";
	
	
	Для Каждого Элемент из СписокГруппировкиЗапроса Цикл 
		Запрос.Текст = Запрос.Текст + ",
		|	" + Элемент.Значение;
	КонецЦикла;		
	
	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(ПланыСчетов.Единый.ДолговыеПрибыльУбыток);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажи);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ДолговыеЧерезПСД);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажиИДоПогашения);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ДолевыеПоСправедливой);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ДолевыеДляПродажи);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ПрибыльУбытокПрошлогоГода);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ПроцентныеДоходы);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ПроцентныеРасходы);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ДоходыРасходыПоРезервам);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ДоходыРасходыОтОпераций);	
	МассивСчетов.Добавить(ПланыСчетов.Единый.ПрочиеДоходыРасходы);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ПроцентныеДоходыПрошлогоГода);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ДоходыИРасходыКромеПроцентныхОтОперацийСФинансовымиИнструментамиПрошлогоГода);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ДоходыИРасходыПоДеятельностиПоНПО);
	
	
	Запрос.УстановитьПараметр("СчетаПартииИДопаналитики", МассивСчетов);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Возврат Выборка;
	
КонецФункции	

Функция ПоСчетуЕстьПартии(Счет)
	
	Результат = Ложь;
	
	
	
	
	
	Возврат Результат;
	
КонецФункции	

Процедура ВывестиПоСчету(Результат, Счет, ВыборкаДетали, КоличествоГруппировок, СписокГруппировкиЗапроса)
			
	ВыборкаДетали.Сбросить();
		
	Если ВыборкаДетали.НайтиСледующий(Новый Структура("Счет", Счет)) Тогда 
		
		Если ВыборкаДетали.КоличествоСубконто = 0 Тогда 
			Возврат;
		КонецЕсли;
		
		ВывестиПодчиненныеГруппировки(КоличествоГруппировок, Результат, ВыборкаДетали, 1, СписокГруппировкиЗапроса);
			
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВывестиПодчиненныеГруппировки(КоличествоГруппировок, Результат, ВыборкаУровеньВыше, НомерГруппировки, СписокГруппировкиЗапроса)	
	
	Если НомерГруппировки > КоличествоГруппировок Тогда 
		Возврат;
	КонецЕсли;	
	
	ИмяГруппировки = СписокГруппировкиЗапроса[НомерГруппировки-1].Значение; 
	ТекущаяВыборка = ВыборкаУровеньВыше.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	Область = Макет.ПолучитьОбласть("ОбластьУровень" + НомерГруппировки);
	
	ВыводитьПоАналитике = Ложь;
	Если ИмяГруппировки = "Субконто1" Тогда 
		ВыводитьПоАналитике = Истина;
	ИначеЕсли (ИмяГруппировки = "Субконто2" И ВыборкаУровеньВыше.КоличествоСубконто = 2) Тогда 
		ВыводитьПоАналитике = Истина;
	ИначеЕсли (ИмяГруппировки = "Партия" И ВыборкаУровеньВыше.ЕстьПартииИДопАналитики) Тогда
		ВыводитьПоАналитике = Истина;
	ИначеЕсли (ИмяГруппировки = "ДополнительнаяАналитика" И ВыборкаУровеньВыше.ЕстьПартииИДопАналитики) Тогда	
		ВыводитьПоАналитике = Истина;
	ИначеЕсли ИмяГруппировки = "ЛицевойСчет" Тогда 
		ВыводитьПоАналитике = Истина;
	КонецЕсли;
	
	Если ВыводитьПоАналитике Тогда 
		Результат.НачатьГруппуСтрок();
	КонецЕсли;	
	Пока ТекущаяВыборка.Следующий() Цикл 
		Если ВыводитьПоАналитике Тогда 
			ВывестиПоАналитике(Результат, ТекущаяВыборка, ТекущаяВыборка[ИмяГруппировки], Область);
		КонецЕсли;
		ВывестиПодчиненныеГруппировки(КоличествоГруппировок, Результат, ТекущаяВыборка, НомерГруппировки + 1, СписокГруппировкиЗапроса);
	КонецЦикла;	
	Если ВыводитьПоАналитике Тогда 
		Результат.ЗакончитьГруппуСтрок();
	КонецЕсли;	
		
КонецПроцедуры 	

#КонецОбласти

#Область ВспомогательныйВывод

Функция ВывестиДанныеСчета(Результат, ОбластьСчет, Счет, СчетКод, СчетНаименование, Субсчет)

	Если ЭтотОбъект.ВыводитьНаименованиеСчета И СчетКод <> "Итого" Тогда
		ОбластьСчет.Параметры.Счет = СчетКод + ", " + СчетНаименование;
	Иначе
		ОбластьСчет.Параметры.Счет = СчетКод;
	КонецЕсли;
	ОбластьСчет.Области.НаименованиеСчета.Отступ = ?(Субсчет, 2, 0);
	
	Уровень = 1;
	Если СчетКод = "Итого" Тогда
		
		ОбластьСчет.Области.ОбластьСчет.Шрифт = Новый Шрифт(ОбластьСчет.ТекущаяОбласть.Шрифт,,, Истина);
		//Уровень = 0;
		
	ИначеЕсли Счет.Вид = ВидСчета.АктивноПассивный Тогда //Аня настаивает на активном или пассивном, а не на активно-пассивном сальдо
	
		Если ОбластьСчет.Параметры.СНД <> Null И ОбластьСчет.Параметры.СНК <> Null Тогда
			
			Если ОбластьСчет.Параметры.СНД >= ОбластьСчет.Параметры.СНК Тогда
			
				ОбластьСчет.Параметры.СНД = ОбластьСчет.Параметры.СНД - ОбластьСчет.Параметры.СНК;
				ОбластьСчет.Параметры.СНК = 0;
				
			Иначе
				
				ОбластьСчет.Параметры.СНК = ОбластьСчет.Параметры.СНК - ОбластьСчет.Параметры.СНД;
				ОбластьСчет.Параметры.СНД = 0;
				
			КонецЕсли;
			
		КонецЕсли;	
		
		Если ОбластьСчет.Параметры.СКД <> Null И ОбластьСчет.Параметры.СКК <> Null Тогда
			
			Если ОбластьСчет.Параметры.СКД >= ОбластьСчет.Параметры.СКК Тогда
			
				ОбластьСчет.Параметры.СКД = ОбластьСчет.Параметры.СКД - ОбластьСчет.Параметры.СКК;
				ОбластьСчет.Параметры.СКК = 0;
				
			Иначе
			
				ОбластьСчет.Параметры.СКК = ОбластьСчет.Параметры.СКК - ОбластьСчет.Параметры.СКД;
				ОбластьСчет.Параметры.СКД = 0;
				
			КонецЕсли;
			
		КонецЕсли;	
	ИначеЕсли Счет.Вид = ВидСчета.Активный Тогда  	
		
		Если ОбластьСчет.Параметры.СНД <> Null И ОбластьСчет.Параметры.СНК <> Null Тогда
			
			Если ОбластьСчет.Параметры.СНК > 0 Тогда 
				ОбластьСчет.Параметры.СНД = ОбластьСчет.Параметры.СНД - ОбластьСчет.Параметры.СНК;
				ОбластьСчет.Параметры.СНК = 0;
			КонецЕсли;	
							
		КонецЕсли;	
		
		Если ОбластьСчет.Параметры.СКД <> Null И ОбластьСчет.Параметры.СКК <> Null Тогда
			
			Если ОбластьСчет.Параметры.СКК > 0 Тогда 
				ОбластьСчет.Параметры.СКД = ОбластьСчет.Параметры.СКД - ОбластьСчет.Параметры.СКК;
				ОбластьСчет.Параметры.СКК = 0;
			КонецЕсли;	
			
		КонецЕсли;	
	ИначеЕсли Счет.Вид = ВидСчета.Пассивный Тогда  	
		
		Если ОбластьСчет.Параметры.СНД <> Null И ОбластьСчет.Параметры.СНК <> Null Тогда			
			
			Если ОбластьСчет.Параметры.СНД > 0 Тогда 
				ОбластьСчет.Параметры.СНК = ОбластьСчет.Параметры.СНК - ОбластьСчет.Параметры.СНД;
				ОбластьСчет.Параметры.СНД = 0;	
			КонецЕсли;	
			
		КонецЕсли;	
		
		Если ОбластьСчет.Параметры.СКД <> Null И ОбластьСчет.Параметры.СКК <> Null Тогда
			
			Если ОбластьСчет.Параметры.СКД > 0 Тогда 
				ОбластьСчет.Параметры.СКК = ОбластьСчет.Параметры.СКК - ОбластьСчет.Параметры.СКД;
				ОбластьСчет.Параметры.СКД = 0;
			КонецЕсли;	
					
		КонецЕсли;		
	КонецЕсли;
	
	Результат.Вывести(ОбластьСчет, Уровень);
	
	Возврат ОбластьСчет.Параметры;
	
КонецФункции

Процедура ВывестиПоАналитике(Результат, Выборка, Аналитика, ОбластьАналитика)

	Если (Выборка.СНД = 0 ИЛИ Выборка.СНД = Null)
		И (Выборка.СНК = 0 ИЛИ Выборка.СНК = Null)
		И (Выборка.ДО = 0 ИЛИ Выборка.ДО = Null)
		И (Выборка.КО = 0 ИЛИ Выборка.КО = Null)
		И (Выборка.СКД = 0 ИЛИ Выборка.СКД = Null)
		И (Выборка.СКК = 0 ИЛИ Выборка.СКК = Null) Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ОбластьАналитика.Параметры, Выборка);
	ОбластьАналитика.Параметры.Аналитика = Аналитика;
	Результат.Вывести(ОбластьАналитика);

КонецПроцедуры


#КонецОбласти

Функция СформироватьОтчет(Результат, Подписант, ГруппировкиОтчета) Экспорт
	
	КоличествоГруппировок = 0;
	СписокГруппировкиЗапроса = Новый СписокЗначений;
	Для Каждого Элемент Из ГруппировкиОтчета Цикл 
		Если Элемент.Значение = "ПоСубконто" И Элемент.Пометка Тогда 
			СписокГруппировкиЗапроса.Добавить("Субконто1");
			СписокГруппировкиЗапроса.Добавить("Субконто2");
			КоличествоГруппировок = КоличествоГруппировок + 2;
		КонецЕсли;	
		Если Элемент.Значение = "ПоПартиям" И Элемент.Пометка Тогда 
			СписокГруппировкиЗапроса.Добавить("Партия");
			КоличествоГруппировок = КоличествоГруппировок + 1;
		КонецЕсли;	
		Если Элемент.Значение = "ПоДополнительнойАналитике" И Элемент.Пометка Тогда 
			СписокГруппировкиЗапроса.Добавить("ДополнительнаяАналитика");
			КоличествоГруппировок = КоличествоГруппировок + 1;
		КонецЕсли;	
		Если Элемент.Значение = "ПоЛицевымСчетам" И Элемент.Пометка Тогда 
			СписокГруппировкиЗапроса.Добавить("ЛицевойСчет");
			КоличествоГруппировок = КоличествоГруппировок + 1;
		КонецЕсли;	
	КонецЦикла;	
			
	Сессия = Неопределено;
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,ПоЛицевымСчетам,ПоСубконто", Новый Структура("Подписант", Подписант));
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
	
	Попытка
    	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);
	Исключение
	КонецПопытки;
	
	Результат.Очистить();
	
	Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьСчет = Макет.ПолучитьОбласть("ОбластьСчет");
	
	ОбластьЗаголовок.Параметры.Организация   = ЭтотОбъект.Организация;
	ОбластьЗаголовок.Параметры.Заголовок   = "Оборотно-сальдовая ведомость без учета закрытия 7-го раздела " + РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПолучитьПредставлениеПериода(ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания);
	ОбластьЗаголовок.Параметры.Параметры   = "Счет д/у: """ + ЭтотОбъект.СчетДоверительногоУправления + """" + Символы.ПС +
			" По договору: №" + ЭтотОбъект.СчетДоверительногоУправления.НомерДоговора + 
			" от " + Формат(ЭтотОбъект.СчетДоверительногоУправления.ДатаЗаключения, "ДФ=dd.MM.yyyy") + " года";
	
	Результат.Вывести(ОбластьЗаголовок);
	
	Результат.НачатьАвтогруппировкуСтрок();
	
	// Бухгалтерские остатки и обороты по счетам и субсчетам
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ПолучитьЗакрытие7гоРаздела(МенеджерВременныхТаблиц);
	
	ТаблицаСчетов = ПолучитьТаблицуСчетов(МенеджерВременныхТаблиц);
	ВыборкаДетали = ПолучитьДанныеПоСубконто(МенеджерВременныхТаблиц, СписокГруппировкиЗапроса);
		
		
	ИтоговыеСуммы = Новый Структура("СНД,СНК,ДО,КО,СКД,СКК",0,0,0,0,0,0);
	
	Для Каждого СтрокаТаблицыСчетов Из ТаблицаСчетов Цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьСчет.Параметры, СтрокаТаблицыСчетов);
		
		Если СтрокаТаблицыСчетов.СчетКод = "Итого" Тогда
			ЗаполнитьЗначенияСвойств(ОбластьСчет.Параметры, ИтоговыеСуммы);
		КонецЕсли;
		
		// Счет, наименование
		СуммыСчета = ВывестиДанныеСчета(Результат, ОбластьСчет, СтрокаТаблицыСчетов.Счет, СтрокаТаблицыСчетов.СчетКод, СтрокаТаблицыСчетов.СчетНаименование, СтрокаТаблицыСчетов.Субсчет);
		
		Если НЕ СтрокаТаблицыСчетов.Субсчет Тогда
			ИтоговыеСуммы.СНД	= ИтоговыеСуммы.СНД + СуммыСчета.СНД;
			ИтоговыеСуммы.СНК	= ИтоговыеСуммы.СНК + СуммыСчета.СНК;
			ИтоговыеСуммы.ДО	= ИтоговыеСуммы.ДО + СуммыСчета.ДО;
			ИтоговыеСуммы.КО	= ИтоговыеСуммы.КО + СуммыСчета.КО;
			ИтоговыеСуммы.СКД	= ИтоговыеСуммы.СКД + СуммыСчета.СКД;
			ИтоговыеСуммы.СКК	= ИтоговыеСуммы.СКК + СуммыСчета.СКК;
		ИначеЕсли СтрокаТаблицыСчетов.Субсчет Тогда 
			// По группировкам
			ВывестиПоСчету(Результат, СтрокаТаблицыСчетов.Счет, ВыборкаДетали, КоличествоГруппировок, СписокГруппировкиЗапроса);	 
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.ЗакончитьАвтогруппировкуСтрок();
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛица(Подписант, ЭтотОбъект.Организация);
		
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
	
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);
	
	КонецЕсли; 
	
	РаботаСОтчетами.ВывестиПодписи(Результат, ПараметрыВыводаПодписей);
	
	Если Сессия <> Неопределено Тогда
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	КонецЕсли;
	
КонецФункции
